; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-29)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 - package
    l1 l2 l3 l4 l5 l6 l7 l8 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l3)
    (at p2 l6)
    (at p3 l2)
    (at p4 l3)
    (at p5 l4)
    (at v1 l7)
    (at v2 l7)
    (at v3 l4)
    (at v4 l7)
    (road l3 l8)
    (road l7 l1)
    (road l2 l7)
    (road l1 l5)
    (road l8 l7)
    (road l6 l8)
    (road l5 l1)
    (road l1 l4)
    (road l1 l7)
    (road l8 l3)
    (road l8 l6)
    (road l7 l2)
    (road l4 l1)
    (road l7 l8)
    (road l2 l4)
    (road l4 l2)
    (road l3 l7)
    (road l7 l3)
    (road l4 l8)
    (road l8 l4)
    (road l3 l5)
    (road l5 l3)
    (road l5 l6)
    (road l6 l5)
    (road l5 l7)
    (road l7 l5)
    (road l2 l6)
    (road l6 l2)
    (road l2 l5)
    (road l5 l2)
    )
 (:goal (and 
(at p5 l5)
))
)

; plan
1. (pick-up v3 l4 p5 c1 c2)
   deleted: (at p5 l4) (capacity v3 c2)
   added: (in p5 v3) (capacity v3 c1)
   goals met: 0 of 1
2. (drive v3 l4 l1)
   deleted: (at v3 l4)
   added: (at v3 l1)
   goals met: 0 of 1
3. (drive v3 l1 l5)
   deleted: (at v3 l1)
   added: (at v3 l5)
   goals met: 0 of 1
4. (drop v3 l5 p5 c1 c2)
   deleted: (in p5 v3) (capacity v3 c1)
   added: (at p5 l5) (capacity v3 c2)
   goals met: 1 of 1
